------
# Course 2 - Week03 - Day02 - Practice Exercise 01
------

# Agenda
- Pandas
  - Readign files from different sources
  - Concatenate series and dataframe
  - Merging, Joining and Reshaping dataframes

# Pandas in Python
- Pandas is an open-source Python Library providing high-performance data manipulation and analysis tool using its powerful data structures
- Using Pandas, we can accomplish five typical steps in the processing and analysis of data, regardless of the origin of data â€” load, prepare, manipulate, model, and analyze
- Python with Pandas is used in a wide range of fields including academic and commercial domains including finance, economics, Statistics, analytics, etc

### Key Features of Pandas
- Fast and efficient DataFrame object with default and customized indexing
- Tools for loading data into in-memory data objects from different file formats
- Data alignment and integrated handling of missing data
- Reshaping and pivoting of date sets
- Label-based slicing, indexing and subsetting of large data sets
- Columns from a data structure can be deleted or inserted
- Group by data for aggregation and transformations
- High performance merging and joining of data
- Time Series functionality

### 1. Reading the files from different sources

##### Read 'Product_Data.xlsx' file and convert it to dataframe

In [6]:
import pandas as pd
pd.read_excel('C:/Users/bhara/Downloads/Datasets+for+Practice+Exercise+C2-W03-DY02-PE02/Product_Data.xlsx')

            Product  Price
0  Desktop Computer    700
1            Tablet    250
2           Printer    120
3            Laptop   1200

##### Read 'Product_Data.html' file and convert it to dataframe

In [11]:
df = pd.read_html("C:/Users/bhara/Downloads/Datasets+for+C2-WK03-DY02-Faculty+Notebook-01/Sheet1.html", header=1, index_col=0)
df

[   Age  Gender  Salary
 1
 2   45    Male   40000
 3   12    Male       0
 4   54  Female  150000
 5   26    Male   30000
 6   64  Female   15000
 7   21  Female   25600]

##### Read 'Product_Data.csv' file and convert it to dataframe

In [15]:
data = pd.read_csv('C:/Users/bhara/Downloads/Dataset+for+Practice_questions_WK03_DY_02/Product_Data.csv', sep="\t")
data.head()

            Product,Price
0  Desktop Computer,700.0
1            Tablet,250.0
2           Printer,120.0
3           Laptop,1200.0

##### Read 'Product_Data.txt' file and convert it to dataframe

In [24]:
df = pd.read_csv("C:/Users/bhara/Downloads/Dataset+for+Practice_questions_WK03_DY_02/Product_Data.txt",sep='\t')
df

            Product  Price
0  Desktop Computer    700
1            Tablet    250
2           Printer    120
3            Laptop   1200

##### Read 'Product_Data.json' file and convert it to dataframe

In [17]:
pd.read_json("C:/Users/bhara/Downloads/Dataset+for+Practice_questions_WK03_DY_02/Product_Data.json")

            Product  Price
0  Desktop Computer    700
1            Tablet    250
2           Printer    120
3            Laptop   1200

##### Read 'Product_Data.xml' file and convert it to dataframe

In [20]:
df = pd.read_xml("C:/Users/bhara/Downloads/Dataset+for+Practice_questions_WK03_DY_02/Product_Data.xml")
df

            Product   Price
0  Desktop Computer   700.0
1            Tablet   250.0
2           Printer   120.0
3            Laptop  1200.0

##### Load wine and diabetes dataset from sklearn and display the details about the dataset

In [2]:
from sklearn.datasets import load_wine,load_diabetics
#wine_dataset=load_wine()
#wine_dataset

ImportError: cannot import name 'load_diabetics' from 'sklearn.datasets' (C:\Users\bhara\anaconda3\Lib\site-packages\sklearn\datasets\__init__.py)

In [3]:
wine_dataset=load_wine()
wine_dataset

{'data': array([[1.423e+01, 1.710e+00, 2.430e+00, ..., 1.040e+00, 3.920e+00,
         1.065e+03],
        [1.320e+01, 1.780e+00, 2.140e+00, ..., 1.050e+00, 3.400e+00,
         1.050e+03],
        [1.316e+01, 2.360e+00, 2.670e+00, ..., 1.030e+00, 3.170e+00,
         1.185e+03],
        ...,
        [1.327e+01, 4.280e+00, 2.260e+00, ..., 5.900e-01, 1.560e+00,
         8.350e+02],
        [1.317e+01, 2.590e+00, 2.370e+00, ..., 6.000e-01, 1.620e+00,
         8.400e+02],
        [1.413e+01, 4.100e+00, 2.740e+00, ..., 6.100e-01, 1.600e+00,
         5.600e+02]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2]),
 'frame': None,
 'target_names': array(['class_0', 'class_1', 'class_2'], dtype='<U7'),
 'DESCR': '.. _wine_dataset:\n\nWine recognition dataset\n------------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 178\n    :Number of Attributes: 13 numeric, predictive attributes and the class\n    :Attribute Information:\n \t\t- Alcohol\n \t\t- Malic acid\n \t\t- Ash\n\t\t- Alcalinity of ash  \n \t\t- Magnesium\n\t\t- Total phenols\n \t\t- Flavanoids\n \t\t- Nonflavanoid phenols\n \t\t- Proanthocyanins\n\t\t- Color intensity\n \t\t- Hue\n \t\t- OD280/OD315 of diluted wines\n \t\t- Proline\n\n    - class:\n            - class_0\n            - class_1\n            - class_2\n\t\t\n    :Summary Statistics:\n    \n    ============================= ==== ===== ======= =====\n                                   Min   Max   Mean     SD\n    ============================= ==== ===== ======= =====\n    Alcohol:                      11.0  14.8    13.0   0.8\n    Malic Acid:                   0.74  5.80    2.34  1.12\n    Ash:                          1.36  3.23    2.36  0.27\n    Alcalinity of Ash:            10.6  30.0    19.5   3.3\n    Magnesium:                    70.0 162.0    99.7  14.3\n    Total Phenols:                0.98  3.88    2.29  0.63\n    Flavanoids:                   0.34  5.08    2.03  1.00\n    Nonflavanoid Phenols:         0.13  0.66    0.36  0.12\n    Proanthocyanins:              0.41  3.58    1.59  0.57\n    Colour Intensity:              1.3  13.0     5.1   2.3\n    Hue:                          0.48  1.71    0.96  0.23\n    OD280/OD315 of diluted wines: 1.27  4.00    2.61  0.71\n    Proline:                       278  1680     746   315\n    ============================= ==== ===== ======= =====\n\n    :Missing Attribute Values: None\n    :Class Distribution: class_0 (59), class_1 (71), class_2 (48)\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThis is a copy of UCI ML Wine recognition datasets.\nhttps://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data\n\nThe data is the results of a chemical analysis of wines grown in the same\nregion in Italy by three different cultivators. There are thirteen different\nmeasurements taken for different constituents found in the three types of\nwine.\n\nOriginal Owners: \n\nForina, M. et al, PARVUS - \nAn Extendible Package for Data Exploration, Classification and Correlation. \nInstitute of Pharmaceutical and Food Analysis and Technologies,\nVia Brigata Salerno, 16147 Genoa, Italy.\n\nCitation:\n\nLichman, M. (2013). UCI Machine Learning Repository\n[https://archive.ics.uci.edu/ml]. Irvine, CA: University of California,\nSchool of Information and Computer Science. \n\n.. topic:: References\n\n  (1) S. Aeberhard, D. Coomans and O. de Vel, \n  Comparison of Classifiers in High Dimensional Settings, \n  Tech. Rep. no. 92-02, (1992), Dept. of Computer Science and Dept. of  \n  Mathematics and Statistics, James Cook University of North Queensland. \n  (Also submitted to Technometrics). \n\n  The data was used with many others for comparing various \n  classifiers. The classes are separable, though only RDA \n  has achieved 100% correct classification. \n  (RDA : 100%, QDA 99.4%, LDA 98.9%, 1NN 96.1% (z-transformed data)) \n  (All results using the leave-one-out technique) \n\n  (2) S. Aeberhard, D. Coomans and O. de Vel, \n  "THE CLASSIFICATION PERFORMANCE OF RDA" \n  Tech. Rep. no. 92-01, (1992), Dept. of Computer Science and Dept. of \n  Mathematics and Statistics, James Cook University of North Queensland. \n  (Also submitted to Journal of Chemometrics).\n',
 'feature_names': ['alcohol',
  'malic_acid',
  'ash',
  'alcalinity_of_ash',
  'magnesium',
  'total_phenols',
  'flavanoids',
  'nonflavanoid_phenols',
  'proanthocyanins',
  'color_intensity',
  'hue',
  'od280/od315_of_diluted_wines',
  'proline']}

### 2. Merging / Concatenating Series

#### Concatenate the series s1 & s2

In [10]:
import numpy as np
import pandas as pd

s1 = pd.Series(["X0", "X1", "X2", "X3"], name="X")
s2 = pd.Series(["0", "-1", "-2", "-3"], name="Y")

In [11]:
pd.concat([s1,s2],axis=1)

    X   Y
0  X0   0
1  X1  -1
2  X2  -2
3  X3  -3

#### Concatenate the series s3, s4 & s5

In [13]:
s3 = pd.Series([0, 1, 2, 3], name="foo")
s3

0    0
1    1
2    2
3    3
Name: foo, dtype: int64

In [14]:
s4 = pd.Series([0, 1, 2, 3], name = 'baz')
s4

0    0
1    1
2    2
3    3
Name: baz, dtype: int64

In [15]:
s5 = pd.Series([0, 1, 4, 5], name='bar')
s5

0    0
1    1
2    4
3    5
Name: bar, dtype: int64

In [16]:
pd.concat([s3,s4,s5],axis=1)

   foo  baz  bar
0    0    0    0
1    1    1    1
2    2    2    4
3    3    3    5

#### Concatenate the series s3, s4 & s5 and change the column names to 'red', 'blue', 'yellow' from 'foo', 'baz' and 'bar'

In [17]:
pd.concat([s3,s4,s5],keys=['red','blue','yellow'],axis=1)

   red  blue  yellow
0    0     0       0
1    1     1       1
2    2     2       4
3    3     3       5

### 3. Merging Dataframe and Series

In [19]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)


df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)


df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

#### Conver the dataframes df1, df2 & df3 to series and then concatenate

In [20]:
pd.concat([df1,df2,df3],axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Convert the dataframes df1, df2 & df3 to sereis and then concatenate by assigning keys 'x', 'y' & 'z'

In [21]:
pd.concat([df1,df2,df3],keys=['x','y','z'],axis=1)

      x                   y                   z
      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### 4. Merging and Concatenating Dataframes
- **Need** - There are times when we need data from two or more dataframes in order to find relation between features. In such cases, pandas concat, merge, join functions are very handy and useful.

In [22]:
import pandas as pd
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

In [23]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [24]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

#### Concatenate the dataframes df1 & df2

In [25]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

#### Concatenate the dataframes df1 & df2 with keys x & y

In [5]:
pd.concat([df1,df2], keys = ['x', 'y'])

      A   B   C   D
x 0  A0  B0  C0  D0
  1  A1  B1  C1  D1
  2  A2  B2  C2  D2
  3  A3  B3  C3  D3
y 4  A4  B4  C4  D4
  5  A5  B5  C5  D5
  6  A6  B6  C6  D6
  7  A7  B7  C7  D7

#### Merging Dataframes

In [27]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [28]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [29]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

#### Merge the dataframes df1 & df2 with 'lkey' and 'rkey'

In [30]:
pd.merge(df1,df2,left_on='lkey',right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

#### Merge the dataframes df1 & df2 with 'lkey', 'rkey' and suffixes=('_left', '_right')

In [31]:
pd.merge(df1,df2,left_on='lkey',right_on='rkey',suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

#### Merge DataFrames df1 and df2, but raise an exception if the DataFrames have any overlapping columns.

#### Do an 'inner' merge with dataframes df1 & df2 on 'value'

In [32]:
pd.merge(df1,df2,on='value',how='inner')

  lkey  value rkey
0  foo      5  foo

#### Do a 'left' merge with dataframes df1 & df2 on 'value'

In [33]:
pd.merge(df1,df2,on='value',how='left')

  lkey  value rkey
0  foo      1  NaN
1  bar      2  NaN
2  baz      3  NaN
3  foo      5  foo

#### Do a 'right' merge with dataframes df1 & df2 on 'value'

In [34]:
pd.merge(df1,df2,on='value',how='right')

  lkey  value rkey
0  foo      5  foo
1  NaN      6  bar
2  NaN      7  baz
3  NaN      8  foo

#### Do a 'cross' merge with dataframes df1 & df2

In [36]:
pd.merge(df1,df2,how='cross')

   lkey  value_x rkey  value_y
0   foo        1  foo        5
1   foo        1  bar        6
2   foo        1  baz        7
3   foo        1  foo        8
4   bar        2  foo        5
5   bar        2  bar        6
6   bar        2  baz        7
7   bar        2  foo        8
8   baz        3  foo        5
9   baz        3  bar        6
10  baz        3  baz        7
11  baz        3  foo        8
12  foo        5  foo        5
13  foo        5  bar        6
14  foo        5  baz        7
15  foo        5  foo        8

### 5. Pandas DataFrame - Join

In [29]:
df1 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
df1

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

In [30]:
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                      'B': ['B0', 'B1', 'B2']})

df2

  key   B
0  K0  B0
1  K1  B1
2  K2  B2

#### Join DataFrames using their indexes.

#### If we want to join using the key columns, we need to set key to be the index in both df1 and df2. The joined DataFrame will have key as its index.
#### Join the dataframes by setting 'key' as index

#### Another option to join using the key columns is to use the on parameter. DataFrame.join always uses otherâ€™s index but we can use any column in df. This method preserves the original DataFrameâ€™s index in the result.

#### Join the dataframes on 'key' and set the 'key' as index only to df2

- Using non-unique key values shows how they are matched.

In [34]:
df3 = pd.DataFrame({'key': ['K0', 'K1', 'K1', 'K3', 'K0', 'K1'],
                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
df3

  key   A
0  K0  A0
1  K1  A1
2  K1  A2
3  K3  A3
4  K0  A4
5  K1  A5

#### Join the dataframes df3 & df2 on 'key' and set the 'key' as index only to df2

### 6. Reshaping by pivoting DataFrame objects
<img src="https://pandas.pydata.org/docs/_images/reshaping_pivot.png" width=500px>

#### Create a dataframe as shown in the above image and then reshape it using pivot

### 7. Reshaping by Stacking and Unstacking
<img src="https://pandas.pydata.org/docs/_images/reshaping_stack.png" width=500px>
<img src="https://pandas.pydata.org/docs/_images/reshaping_unstack.png" width=500px>

#### Create a dataframe as shown in tha above image and then reshpae it using stacking and unstacking methods

### 8. Reshaping by melt
<img src="https://pandas.pydata.org/docs/_images/reshaping_melt.png" width=500px>

#### Create a dataframe as shown in tha above image and then reshape it using melt command

### 9. Reshaping using wide_to_long
Another way to transform is to use the wide_to_long() panel data convenience function. It is less flexible than melt(), but more user-friendly.

In [135]:
df = pd.DataFrame(
    {
        "A1970": {0: "a", 1: "b", 2: "c"},
        "A1980": {0: "d", 1: "e", 2: "f"},
        "B1970": {0: 2.5, 1: 1.2, 2: 0.7},
        "B1980": {0: 3.2, 1: 1.3, 2: 0.1},
        "X": dict(zip(range(3), np.random.randn(3))),
    }
)
df

  A1970 A1980  B1970  B1980         X
0     a     d    2.5    3.2 -0.935682
1     b     e    1.2    1.3  0.080313
2     c     f    0.7    0.1  2.319177

#### Reshape the above dataframe df using wide_to_long function

## Happy Learning :)